In [1]:
print("Hello World")

Hello World

In [4]:
import pandas as pd
df = pd.read_csv('emp_info.csv')

In [5]:
df

   empid empname  empsal
0  12141   SRINI      90
1  12142   SANDY      80
2  12143    ABHI      70

In [9]:
df.to_csv('emp_info_copy.csv',index=False)

In [10]:
df = pd.read_csv('emp_info_copy.csv')

In [7]:
df

NameError: name 'df' is not defined

In [18]:
df = pd.read_csv('emp_info_copy.csv',delimiter='|')

In [19]:
df

   empid empname  empsal
0  12141   SRINI      90
1  12142   SANDY      80
2  12143    ABHI      70

In [5]:
import pandas as pd
from sqlalchemy import create_engine
mysql_engine = create_engine('mysql+pymysql://root:Newuser%40123@localhost:3306/balaqadb')
connection = mysql_engine.connect()

df_query = pd.read_sql("select * from employees",mysql_engine)

In [6]:
df_query

   emp_id emp_name  emp_sal
0   42111     bala     1500